weblog/app/controllers/posts_controller.rb

INSERT INTO `comments` (`body`, `post_id`) VALUES('I happy for you too', 1)
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def comment
   Post.find(params[:id]).comments.create(params[:comment])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def edit
    @post = Post.find(params[:id])

SELECT * FROM `posts` WHERE (title LIKE '%Hi%')
---
 def search
    @posts = Post.find(:all, :conditions => ["title LIKE ?", "%#{params[:key]}%"]) ||
    @posts = Post.find(:all, :conditions => ["body LIKE ?", "%#{params[:key]}%"])

INSERT INTO `posts` (`title`, `body`, `date`) VALUES('My First webolg', 'I am really happy of my first work.', '2009-04-28 15:19:00')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
DELETE FROM `posts` WHERE `id` = 3
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy